app/Http/Controllers/TasksController.php

    public function index()
    {
        $categories = Categories::all();

        $selectedCategory = request('categoryFilter', 'all');

        $tasksQuery = Auth::user()->tasks();

        if ($selectedCategory !== 'all') {
            $tasksQuery->where('category_id', $selectedCategory);
        }

        $tasks = $tasksQuery->get();
---
SELECT * FROM `users` WHERE `users`.`id` in (2)

            $task->taskimage = $imagePath;
        }

        $task->save();
---
UPDATE `tasks` SET `status` = 'Active', `category_id` = '2', `tasks`.`updated_at` = '2024-02-25 11:06:14' WHERE `id` = 1