app/Http/Controllers/TasksController.php

SELECT * FROM `categories`
---
    public function index()
    {
        $tasks = Auth::user()->tasks;
        $categories = \App\Models\Categories::all();

SELECT * FROM `tasks` WHERE `tasks`.`user_id` = 2 and `tasks`.`user_id` IS not NULL and `tasks`.`deleted_at` IS not NULL
---
    public function viewtrash()
    {
        $tasks = Auth::user()->tasks()->onlyTrashed()->get();

INSERT INTO `tasks` (`date`, `topic`, `status`, `user_id`, `category_id`, `updated_at`, `created_at`) VALUES ('2024-02-24', 'Some other thing', 'Completed', 2, '2', '2024-02-24 18:10:56', '2024-02-24 18:10:56')
---
    public function store(Request $request)
    {
        // Check if the user is authenticated
        if (Auth::check()) {
            $request->validate([
                'date' => 'required|date',
                'topic' => 'required|string',
                'status' => 'required|in:Completed,Active,Inactive',
                'category' => 'required|exists:categories,id',
            ]);

            $task = new Tasks;
            $task->date = $request->input('date');
            $task->topic = $request->input('topic');
            $task->status = $request->input('status');
            $task->user_id = auth()->user()->id;
            $task->category_id = $request->input('category');
            $task->save();

SELECT * FROM `tasks` WHERE `tasks`.`user_id` = 2 and `tasks`.`user_id` IS not NULL and `tasks`.`id` = '1' and `tasks`.`deleted_at` IS NULL LIMIT 1
UPDATE `tasks` SET `deleted_at` = '2024-02-24 18:12:19', `tasks`.`updated_at` = '2024-02-24 18:12:19' WHERE `id` = 1
---
    public function delete($id)
    {
        $task = Auth::user()->tasks()->find($id);
        if ($task) {
            $task->delete();

SELECT * FROM `tasks` WHERE `tasks`.`user_id` = 2 and `tasks`.`user_id` IS not NULL and `tasks`.`id` = '1' LIMIT 1
UPDATE `tasks` SET `deleted_at` = , `tasks`.`updated_at` = '2024-02-25 10:56:57' WHERE `id` = 1
---
    public function restore($id)
    {
        $task = Auth::user()->tasks()->withTrashed()->find($id);
        if ($task) {
            $task->restore();

SELECT * FROM `tasks` WHERE `tasks`.`user_id` = 2 and `tasks`.`user_id` IS not NULL and `tasks`.`id` = '1' and `tasks`.`deleted_at` IS NULL LIMIT 1
---
    public function edit(Request $request, $id)
    {
        $task = Auth::user()->tasks()->find($id);